✅ Terraform plan

<details><summary>Expand...</summary>

```
google_project.project: Refreshing state... [id=projects/arikkfir]
google_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=arikkfir/serviceusage.googleapis.com]
google_storage_bucket.arikkfir-devops: Refreshing state... [id=arikkfir-devops]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=arikkfir/secretmanager.googleapis.com]
google_project_service.apis["cloudbilling.googleapis.com"]: Refreshing state... [id=arikkfir/cloudbilling.googleapis.com]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=arikkfir/dns.googleapis.com]
google_project_service.apis["containerfilesystem.googleapis.com"]: Refreshing state... [id=arikkfir/containerfilesystem.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=arikkfir/iam.googleapis.com]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=arikkfir/monitoring.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=arikkfir/cloudresourcemanager.googleapis.com]
google_project_service.apis["storage-api.googleapis.com"]: Refreshing state... [id=arikkfir/storage-api.googleapis.com]
google_project_service.apis["storage-component.googleapis.com"]: Refreshing state... [id=arikkfir/storage-component.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=arikkfir/pubsub.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=arikkfir/iamcredentials.googleapis.com]
google_project_service.apis["oslogin.googleapis.com"]: Refreshing state... [id=arikkfir/oslogin.googleapis.com]
google_project_service.apis["servicemanagement.googleapis.com"]: Refreshing state... [id=arikkfir/servicemanagement.googleapis.com]
google_project_service.apis["bigquerystorage.googleapis.com"]: Refreshing state... [id=arikkfir/bigquerystorage.googleapis.com]
google_project_service.apis["containerregistry.googleapis.com"]: Refreshing state... [id=arikkfir/containerregistry.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=arikkfir/compute.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=arikkfir/container.googleapis.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=arikkfir/logging.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=arikkfir/artifactregistry.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=arikkfir/bigquery.googleapis.com]
google_service_account.gha-arikkfir-infrastructure: Refreshing state... [id=projects/arikkfir/serviceAccounts/gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-resourcemanager-organizationViewer: Refreshing state... [id=468825984716/roles/resourcemanager.organizationViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-admin: Refreshing state... [id=b/arikkfir-devops/roles/storage.admin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_storage_bucket_iam_member.arikkfir-devops-gha-arikkfir-infrastructure-storage-objectAdmin: Refreshing state... [id=b/arikkfir-devops/roles/storage.objectAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-browser: Refreshing state... [id=arikkfir/roles/browser/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_organization_iam_member.kfirfamily-gha-arikkfir-infrastructure-iam-organizationRoleViewer: Refreshing state... [id=468825984716/roles/iam.organizationRoleViewer/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-serviceusage-serviceUsageAdmin: Refreshing state... [id=arikkfir/roles/serviceusage.serviceUsageAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]
google_project_iam_member.gha-arikkfir-infrastructure-iam-serviceAccountAdmin: Refreshing state... [id=arikkfir/roles/iam.serviceAccountAdmin/serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.gke will be created
  + resource "google_compute_network" "gke" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "GKE VPC"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "gke"
      + project                         = "arikkfir"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.gke-subnet will be created
  + resource "google_compute_subnetwork" "gke-subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.100.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "gke-subnet-europe-west3"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "arikkfir"
      + purpose                    = (known after apply)
      + region                     = "europe-west3"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.110.0.0/17"
              + range_name    = "gke-pods"
            },
          + {
              + ip_cidr_range = "10.110.128.0/17"
              + range_name    = "gke-services"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_project_iam_member.gke-node-logging-logWriter will be created
  + resource "google_project_iam_member" "gke-node-logging-logWriter" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "arikkfir"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.gke-node-monitoring-metricWriter will be created
  + resource "google_project_iam_member" "gke-node-monitoring-metricWriter" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "arikkfir"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_service_account.config-connector will be created
  + resource "google_service_account" "config-connector" {
      + account_id   = "config-connector"
      + disabled     = false
      + display_name = "GKE Config Connector"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account.gke-node will be created
  + resource "google_service_account" "gke-node" {
      + account_id   = "gke-node"
      + disabled     = false
      + display_name = "GKE nodes service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.config_connector_workload_identity will be created
  + resource "google_service_account_iam_member" "config_connector_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:arikkfir.svc.id.goog[cnrm-system/cnrm-controller-manager]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>